{
  "id": "welcome-to-my-blog",
  "title": "Welcome to My Blog: The Beginning of a Tech Journey",
  "date": "March 4 2025",
  "author": "DEV_NAME_",
  "tags": ["Introduction", "Personal", "Development"],
  "content": "<p>Welcome to my first blog on my website! Hopefully this'll be the first of many, many blogs that I do, that'll range from software development, to all manners of cybersecurity stuff! I'll try and keep them all fun, informative, and reflective of anything cool I make!</p><br><p>I'll try my best to write a blog twice a month, and hopefully once a week, however quality will be prioritised over quantity, of course. Hopefully you'll enjoy all my blogs, have a look at a few of my projects, and have a tinker at the interactive terminal I've made (which will hopefully have more and more stuff in it over time!)</p><h2>What to Expect</h2><p>In the coming weeks and months, I plan to share:</p><br><ul><li>Tutorials and walkthroughs of interesting coding problems</li><li>Cybersecurity insights and discoveries</li><li>Deep dives into technologies I'm currently exploring</li><li>Updates on personal projects I'm working on</li><li>Reflections on my learning journey</li></ul><h2>About Me</h2><p>For those who don't know me yet, I'm a developer with a passion for cybersecurity and creating useful, interactive web applications. This portfolio site is both a showcase of my work and a playground where I can experiment with new ideas.</p><br><p>The interactive terminal you might have noticed is one such experiment - it's designed to be both functional and fun, giving you a different way to explore my portfolio. I'll be adding more commands and features to it over time!</p><h2>Let's Connect</h2><p>I'm always open to feedback, questions, or just a friendly chat about tech. Don't hesitate to reach out if you find something interesting here or have suggestions for future topics.</p><br><p>Thanks for stopping by, and I hope you'll join me on this journey!</p><br><p>- Iolo</p>"
}