{
  "id": "password-strength-analyser",
  "title": "Password Strength Analyser",
  "description": "A real-time password strength assessment tool with visual indicators, pattern detection, and custom recommendations.",
  "date": "2025-03-01",
  "tags": ["HTML", "CSS", "JavaScript", "Security", "Frontend"],
  "github": "https://github.com/ioloEJ42/Password-strength-checker",
  "live": "https://pwd-checker.netlify.app/",
  "content": "<h2>Project Overview</h2><p>In my honest opinion, a password strength checker is just the security equivalent of \"Hello World\", so consider this an obligatory entry project.</p><p>This analyser provides real-time feedback on password strength without any unnecessary complexity or feature bloat. Just pure, straightforward password analysis.</p><h2>Key Features</h2><ul><li><strong>Real-time Analysis:</strong> Immediate feedback as you type</li><li><strong>Visual Strength Meter:</strong> Color-coded segments showing password strength from 0-100</li><li><strong>Basic Requirements Checking:</strong> Length, uppercase, lowercase, numbers, special characters</li><li><strong>Advanced Pattern Detection:</strong> Identifies common passwords, repeated characters, sequential patterns, and personal information</li><li><strong>Terminal-style Recommendations:</strong> Custom, actionable advice to improve password security</li><li><strong>Clean, Responsive UI:</strong> Works on all devices without unnecessary visual clutter</li></ul><h2>Technical Implementation</h2><p>Built with vanilla web technologies to demonstrate core fundamentals:</p><br><ul><li><strong>HTML5:</strong> Semantic structure for the analyser interface</li><li><strong>CSS3:</strong> Custom styling for visual indicators and responsive design</li><li><strong>Vanilla JavaScript:</strong> No frameworks or libraries - just clean, efficient code</li></ul><h2>Security Aspects</h2><p>The analyser implements several key security principles:</p><br><ul><li>Password complexity assessment using multiple criteria</li><li>Common password database comparison</li><li>Pattern recognition algorithms to detect weak security patterns</li><li>Security-focused UI with password visibility toggle</li></ul><p>While it's a simple project, it demonstrates fundamental security concepts that form the foundation of more complex security applications. Sometimes the most important security tools are the ones that help users create better passwords in the first place.</p>"
}
